## Task 4: Pandas CSV Load

In [2]:
import pandas as pd

In [4]:
df=pd.read_csv(r"C:/Users/nithy/OneDrive/Desktop/Training/Level_1/data.csv")
df

       Name  Age
0    Sahana   21
1   Shalini   20
2   Karthik   23
3  Mukilesh   22
4    Nivash   22
5  Sharjana   24
6       Sri   25
7     Agnes   28
8      Suba   21

In [6]:
df.head(5)

       Name  Age
0    Sahana   21
1   Shalini   20
2   Karthik   23
3  Mukilesh   22
4    Nivash   22

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Age     9 non-null      int64
dtypes: int64(1), object(1)
memory usage: 276.0+ bytes

In [10]:
df.describe()

             Age
count   9.000000
mean   22.888889
std     2.472066
min    20.000000
25%    21.000000
50%    22.000000
75%    24.000000
max    28.000000